[lang-en]
# 帮助模块\r\n\r\n如果你想学习如何开发 CapsLockX 的插件，请：\r\n\r\n1. 打开 `Modules/@Help.ahk` ， 你可以了解到 CapsLockX 插件的基本格式\r\n2. 将它复制一份，命名为你自己的插件名称\r\n3. 将它本来的功能改成你自己需要的功能，插件的开发就完成啦！\r\n\r\n## 本模块功能见下\r\n\r\n| 作用于 | 按键                  | 功能                             |\r\n| ------ | --------------------- | -------------------------------- |\r\n| 全局   | CapsLockX + /         | 临时显示热键提示                 |\r\n| 全局   | CapsLockX + Alt + /   | 🔗 打开 CapsLockX 的完整文档页面 |\r\n| 全局   | CapsLockX + Shift + / | 🕷 提交 bug、建议等               |\r=# Help Module\n\nIf you want to learn how to develop plugins for CapsLockX, please:\n\n1. Open `Modules/@Help.ahk`, where you can learn about the basic format of a CapsLockX plugin\n2. Make a copy of it and name it as your own plugin\n3. Change its original functions to the ones you need, and your plugin development is complete!\n\n## Features of this module are as follows\n\n| Applied to | Key                | Function                                      |\n| ---------- | ------------------ | --------------------------------------------- |\n| Global     | CapsLockX + /      | Temporarily display hotkey hints              |\n| Global     | CapsLockX + Alt + /| 🔗 Open the complete CapsLockX documentation page |\n| Global     | CapsLockX + Shift + / | 🕷 Submit bugs, suggestions, etc.             |
# Anki 增强模块\r\n\r\nAnki 操作增强\r\n\r\n## 常用功能/特性\r\n\r\n1. 使用 WASD 或 HJKL 来快速连续地（并且可以撤销）切换记忆卡片\r\n2. 在 Excel 制作一个单词列表，共 2 列， 全选复制，然后在 Anki 中按 Alt + i 来快速导入单词列表。\r\n3. 简化 4 个选项为 3 个方向键，左易，下中，右难，上撤销。\r\n4. 可配合手柄使用，使用 XPadder 配置手柄摇杆映射到方向键即可。效果请见 bilibili [中二雪星怎背词 - 手柄怎么可以不用来背单词！](https://www.bilibili.com/video/av8456838/)\r\n\r\n## 说明\r\n\r\n| 模式                 | Anki 增强模块  | 说明                                                        |\r\n| -------------------- | :------------: | ----------------------------------------------------------- |\r\n| 在 Anki-学习界面     | `w 或 k 或 ↑`  | 按下\e撤销，松开显示答案                                     |\r\n| 在 Anki-学习界面     | `a 或 h 或 ←`  | 按下\e顺利，松开显示答案                                     |\r\n| 在 Anki-学习界面     | `s 或 j 或 ↓`  | 按下\e一般，松开显示答案                                     |\r\n| 在 Anki-学习界面     | `d 或 l 或 →`  | 按下\e生疏，松开显示答案                                     |\r\n| 在 Anki-学习界面     |      `q`       | 返回上个界面                                                |\r\n| 在 Anki-学习界面     |      `c`       | 添加新卡片                                                  |\r\n| 在 Anki-学习界面     | `1 或 NumPad1` | 困难（原键位）                                              |\r\n| 在 Anki-学习界面     | `2 或 NumPad2` | 生疏（原键位）                                              |\r\n| 在 Anki-学习界面     | `3 或 NumPad3` | 一般（原键位）                                              |\r\n| 在 Anki-学习界面     | `4 或 NumPad4` | 顺利（原键位）                                              |\r\n| 在 Anki-学习界面     | `5 或 NumPad5` | 撤销                                                        |\r\n| 在 Anki-学习界面     | `6 或 NumPad6` | 暂停卡片                                                    |\r\n| 在 Anki-学习界面     |   `Alt + i`    | 快速导入剪贴版的内容（按 Tab 分割） / 比如可以从 Excel 复制 |\r\n| 在 Anki-添加卡片界面 |   `Alt + s`    | 按下 添加 按钮                                              |\r=# Anki Enhancement Module\n\nEnhanced Anki Operations\n\n## Common Features\n\n1. Use WASD or HJKL to quickly and continuously (and with the ability to undo) switch flashcards.\n2. Create a word list in Excel with 2 columns, select all and copy, then press Alt + i in Anki to quickly import the word list.\n3. Simplify the 4 options to 3 direction keys: left-easy, down-medium, right-hard, up-undo.\n4. Can be used with a game controller by configuring the joystick to map to direction keys using XPadder. For effects, see bilibili [Chuunibyou Xue Xing's Word Memorization with a Game Controller!](https://www.bilibili.com/video/av8456838/)\n\n## Instructions\n\n| Mode                  | Anki Enhancement Module | Description                                                   |\n| --------------------- | :---------------------: | ------------------------------------------------------------ |\n| In Anki-Learning Interface | `w or k or ↑`
# 讯飞输入法悬浮窗插件\r\n\r\n## 用法\r\n\r\n| 作用于 |     按键      | 功能说明              |\r\n| ------ | :-----------: | --------------------- |\r\n| 全局   | Win + Alt + H | 启动/切换讯飞语音输入 |\r\n\r\n## 注\r\n\r\n1. 若没有安装讯飞语音则会自动询问是否引导下载安装\r\n\r\n## 效果如下图\r\n\r\n![App-讯飞语音输入法悬浮窗演示.gif](./docs/media/App-讯飞语音输入法悬浮窗演示.gif)\r=# iFlytek Input Method Floating Window Plugin\n\n## Usage\n\n| Applied To |     Key Combo     | Function Description    |\n| ---------- | :---------------: | ----------------------- |\n| Global     | Win + Alt + H     | Launch/Switch iFlytek Voice Input |\n\n## Notes\n\n1. If iFlytek Voice is not installed, it will automatically prompt whether to guide for download and installation.\n\n## Effect shown in the image below\n\n![App-iFlytek Voice Input Method Floating Window Demo.gif](./docs/media/App-讯飞语音输入法悬浮窗演示.gif)
# OneNote 2016 - 2019 增强\r\n\r\n朴素地增强 OneNote 2016 - 2019 的键盘操作，便捷地使用键盘来：换笔，制作链接，整理页面，调整视图……\r\n\r\n## 雪星喵常用功能\r\n\r\n1. 做日志的时候，先在笔记页面 `Alt + T` 给笔记标题添加日期标签（用于将来搜索），然后全局 `Win + Shift + N` 在 OneNote 搜索带有 今日标签 的所有笔记，用来方便地检索你今日的：恋爱日记、训练日志、每日书单、项目日报……总之在 OneNote 写日记就很方便了，一按就出来，不用找 XD\r\n2. 选一个词按 `Alt + K` ，会把所有相关的页面链接列到这个词的下方，用来做索引目录，把你的 OneNote 织成一张网。\r\n3. 新建一个笔记，改名叫 `我的剪贴板`，然后在复制文本、图片的时候，CLX 会帮你自动追加到这个笔记，用于方便地收集资料或摘抄文章。\r\n4. Alt + 1234567 层级折叠，轻松地在不同抽象层次的思考上切换。\r\n\r\n## 按键分布设计（开发中）\r\n\r\n| 按键描述                | 作用                    | 备注       |\r\n| ----------------------- | ----------------------- | ---------- |\r\n| `所有 OneNote 自带热键` | 原功能                  |            |\r\n| `按一下 Alt 再按别的`   | 触发 OneNote 原菜单功能 |            |\r\n| `Alt + 1234567`         | 大纲折叠展开到 1-7 层级 |            |\r\n| `Alt + qwe asd r`       | 工具、换笔、视图        |            |\r\n| `Alt + f`               | 查找标签                |            |\r\n| `Alt + -\e`              | 公式相关                |            |\r\n| `Alt + m`               | 移动笔记、分区          |            |\r\n| `Alt + hjkl`            | 各种链接功能            |            |\r\n| `Alt + zxcv`            | 高级复制粘贴            | 细节开发中 |\r\n| `Alt + /`               | 热键帮助、提示          | 开发中     |\r\n| `F2 F3`                 | 重命名、查找笔记        |            |\r\n\r\n## 详细按键表 / CheatSheet\r\n\r\n| 作用于                   | 格式热键                     | 功能                                                                      |\r\n| ------------------------ | ---------------------------- | ------------------------------------------------------------------------- |\r\n| 全局                     | `Win + Alt + N`              | 打开快速笔记第一页（弥补 OneNote 原本没有像 Notion 一样的首页概念的不足） |\r\n| 全局                     | `Win + Shift + N`            | 打开 OneNote 并精确搜索今日标签                                           |\r\n| OneNote2019              | `Alt + 1234567`              | 大纲：大纲折叠展开到那层（强烈推荐，超好用）                              |\r\n| OneNote2019              | `F2`                         | 整理：重命名笔记                                                          |\r\n| OneNote2019              | `Shift + F2`                 | 整理：重命名分区                                                          |\r\n| OneNote2019              | `Alt + m`                    | 整理：移动笔记                                                            |\r\n| OneNote2019              | `Alt + Shift + m`            | 整理：移动分区                                                            |\r\n| OneNote2019              | `Ctrl + n`                   | 整理：新建笔记                                                            |\r\n| OneNote2019              | `Ctrl + Alt + n`             | 整理：在当前笔记下方新建笔记                                              |\r\n| OneNote2019              | `Alt + Delete`               | 整理：快速删除当前页面                                                    |\r\n| OneNote2019              | `Ctrl + s`                   | 整理：立即同步此笔记本                                                    |\r\n| OneNote2019              | `Ctrl + w`                   | 整理：关闭窗口                                                            |\r\n| OneNote2019              | `Shift + Delete`             | 编辑：快速删除当前行                                                      |\r\n| OneNote2019              | `Alt + -`                    | 编辑：自动 2 维化公式                                                     |\r\n| OneNote2019              | `Alt + k`                    | 编辑：⭐🔗 展开当前关键词的相关页面链接（快速关键词一对多链接）           |\r\n| OneNote2019              | `Alt + n`                    | 样式：切换页面为无色背景                                                  |\r\n| OneNote2019              | `Alt + v`                    | 样式：改变文字背景色                                                      |\r\n| OneNote2019              | `Alt + q`                    | 工具：拖动                                                                |\r\n| OneNote2019              | `Alt + w`                    | 工具：套锁                                                                |\r\n| OneNote2019              | `Alt + e`                    | 工具：橡皮                                                                |\r\n| OneNote2019              | `Alt + s`                    | 工具：输入                                                                |\r\n| OneNote2019              | `Alt + a`                    | 工具：换到第 2 支笔                                                       |\r\n| OneNote2019              | `Alt + d`                    | 工具：打开换笔盘（然后可可方向键选笔 （目前全屏无效）                     |\r\n| OneNote2019              | `Alt + d -> 1234567`         | 工具：打开换笔盘（然后选第 1 行第 x 支笔） （目前全屏无效）               |\r\n| OneNote2019              | `Alt + d -> Shift + 1234567` | 工具：打开换笔盘（然后选第 2 行第 x 支笔） （目前全屏无效）               |\r\n| OneNote2019              | `Alt + r`                    | 视图：缩放到原始大小                                                      |\r\n| OneNote2019              | `Alt + y`                    | 视图：缩放到页面宽度                                                      |\r\n| OneNote2019              | `^!+- 或 ^!+\e`               | 视图：缩小页面 或 放大页面                                                |\r\n| OneNote2019              | `Alt + f`                    | 视图：搜索标记                                                            |\r\n| OneNote2019              | `Alt + t`                    | 编辑：给笔记增加日期标签，例如： (20220717)                               |\r\n| OneNote2019              | `Ctrl + Shift + c`           | 编辑：复制（纯文本）                                                      |\r\n| OneNote2019              | `Ctrl + Shift + v`           | 编辑：粘贴（纯文本）                                                      |\r\n| OneNote2019 创建链接窗口 | `Alt + s`                    | 编辑：复制当前所有搜索结果页面的链接                                      |\r\n| OneNote2019 创建链接窗口 | `Alt + Shift + s`            | 编辑：复制当前所有搜索结果页面的链接并粘贴                                |\r\n| OneNote2019 剪贴板笔记   | `Ctrl + C`                   | 编辑：⭐ 追加复制的内容到名称中含有 "Clipboard" 或 "剪贴板" 的笔记        |\r=# OneNote 2016 - 2019 Enhancement\n\nEnhance keyboard operations for OneNote 2016 - 2019 simply, conveniently using the keyboard to: change pens, create links, organize pages, adjust views...\n\n## Common Features by Snow Star\n\n1. When logging, first add a date tag to the note title on the note page with `Alt + T` (for future search), then globally `Win + Shift + N` to search all notes with today's tag in OneNote, for easy retrieval of today's: love diary, training log, daily book list, project daily report... In short, writing diaries in OneNote is very convenient, just one press, no need to search XD\n2. Select a word and press `Alt + K`, which will list links to all related pages below this word, to make an index directory and weave your OneNote into a web.\n3. Create a new note and rename it "My Clipboard," then when copying text or images, CLX will automatically append it to this note for easy gathering of materials or excerpting articles.\n4. Alt + 1234567 level folding, easily switch between different levels of abstraction in thinking.\n\n## Key Distribution Design (under development)\n\n| Key Description          | Function                    | Note       |\n| ------------------------ | ---------------------------- | ---------- |\n| `All OneNote Built-in Hotkeys` | Original function          |            |\n| `Press Alt then something else` | Trigger OneNote original menu function |            |\n| `Alt + 1234567`          | Outline folding to levels 1-7|            |\n| `Alt + qwe asd r`        | Tools, change pen, view      |            |\n| `Alt + f`                | Search tags                  |            |\n| `Alt + -\e`               | Formula-related              |            |\n| `Alt + m`                |
# CLX - Brainstorm 大脳风暴\r\n\r\n任何時間，任何輸入框，按下 `CLX+b` 鍵，開始使用 AI 輔助輸入。\r\n\r\n## 按键分布（开发中）\r\n\r\n| 按键描述        | 作用                                                 | 备注 |\r\n| --------------- | ---------------------------------------------------- | ---- |\r\n| CLX + b         | 自動複製当前选中内容，輸入指令，让 AI 辅助你的輸入   |      |\r\n| CLX + Alt + b   | 配置激活碼（目前只有免費方案，将来可能加入功能増強） |      |\r\n| CLX + Shift + b | 査看使用額度                                         |      |\r\n\r\n## Protips:\r\n\r\n### 随時整理会議記録\r\n\r\n1. 任何輸入框内，使用 Win+H 來調出語音輸入，然後說出你想要的文字，不用在意語音輸入的準確度，只要說出大概的意思就可以了，\r\n2. 然後全選按下 `CLX+b`，輸入 `列出要点和待辦事項`，就可以看到 AI 自動幫你整理出來的要點和待辦事項。\r\n\r\n### 随時翻訳任何語言到任何語言\r\n\r\n1. 任何輸入框内，选中你想要翻譯的文字\r\n2. 然後全選按下 `CLX+b`，`to chinese:` AI 自動幫你輸入成中文。\r=# CLX - Brainstorm Cerebral Storm\n\nAnytime, in any input box, press `CLX+b` to start using AI-assisted input.\n\n## Key Distribution (In Development)\n\n| Key Description  | Function                                              | Notes |\n| ---------------- | ----------------------------------------------------- | ----- |\n| CLX + b          | Automatically copies the currently selected content, enters commands, allowing AI to assist your input |       |\n| CLX + Alt + b    | Configure activation code (currently only a free plan, more features may be added in the future) |       |\n| CLX + Shift + b  | Check usage quota                                     |       |\n\n## Protips:\n\n### Organize Meeting Notes Anytime\n\n1. In any input box, use Win+H to bring up voice input, then say what you want to type. Don't worry about the accuracy of the voice input, just convey the general idea.\n2. Then select all, press `CLX+b`, and input `List key points and tasks`, and AI will automatically help you organize the key points and tasks.\n\n### Translate Any Language to Any Language Anytime\n\n1. In any input box, select the text you want to translate\n2. Then select all, press `CLX+b`, and enter `to chinese:` and AI will automatically help you translate into Chinese.
# Surface 笔记本扩充功能键\r\n\r\n专治各种笔记本残破键盘\r\n\r\n1. 没有右 Ctrl 键？合并 Menu 与 右 Ctrl 键，Menu 当 Ctrl 用 或者 Ctrl 当 Menu 用都可以\r\n2. 没有 Pause 键？Win + Alt + P 也能打开系统设定信息。\r\n3. 待补充\r\n\r\n| 模式             | 按键                                  | 功能                               |\r\n| ---------------- | :------------------------------------ | ---------------------------------- |\r\n| 全局             | Win + Alt + P                         | 相当于 Win + Pause，专为笔记本定制 |\r\n| 全局             | 右 Ctrl 按一下                        | 会按一下 Menu 弹出菜单             |\r\n| 全局             | 按住右 Menu                           | 会按住 Ctrl，此时可以与其它键组合  |\r\n| Win 键模拟启用后 | ] 按住同时，[ 按下                    | 相当于按 Win 键                    |\r\n| Win 键模拟启用后 | RAlt+\\| 相当于按 Alt+Tab 只不过在右手 |\r=# Surface Notebook Extended Function Keys\n\nSpecially designed for all types of broken laptop keyboards\n\n1. No right Ctrl key? Merge Menu and right Ctrl keys, use Menu as Ctrl or Ctrl as Menu.\n2. No Pause key? Win + Alt + P can also open the system settings information.\n3. To be supplemented\n\n| Mode             | Key                                   | Function                           |\n| ---------------- | :------------------------------------ | ---------------------------------- |\n| Global           | Win + Alt + P                         | Equivalent to Win + Pause, customized for laptops |\n| Global           | Right Ctrl pressed once               | Will press Menu to pop up the menu |\n| Global           | Hold the right Menu                   | Will hold Ctrl, can be combined with other keys |\n| After enabling Win key simulation | Hold ] and press [         | Equivalent to pressing Win key     |\n| After enabling Win key simulation | RAlt+\\| Equivalent to pressing Alt+Tab but on the right hand |
# 编辑增强插件（ TG YUIO HJKL ） 🌟\r\n\r\n这个世界上还有比 Vim 模式的 HJKL 移动光标更棒的东西吗？\r\n这个必须有！\r\n那就是带加速度的 HJKL 流畅编辑体验！想不想试试让你的光标来一次排水沟过弯的高端操作？装它！\r\n\r\n![EditorCursorMovement.gif](./docs/media/EditorCursorMovement.gif)\r\n\r\n| 作用域     | Edit 模块             | 说明                             |\r\n| ---------- | --------------------- | -------------------------------- |\r\n| 全局(基本) | `CapsLockX + h j k l` | 上下左右 方向键                  |\r\n| 全局(基本) | `CapsLockX + y o`     | Home End                         |\r\n| 全局(基本) | `CapsLockX + u i`     | PageUp PageDown                  |\r\n| 全局(基本) | `CapsLockX + [ ]`     | Shift+Tab 和 Tab                 |\r\n| 全局(基本) | `CapsLockX + g`       | 回车                             |\r\n| 全局(进阶) | `CapsLockX + t`       | Delete                           |\r\n| 全局(进阶) | `CapsLockX + hl`      | hl 一起按选择当前词              |\r\n| 全局(进阶) | `CapsLockX + kj`      | kj 一起按选择当前行              |\r\n| 全局(进阶) | `CapsLockX + h + t`   | 移位后删：大部分情况可代替退格键 |\r=# Edit Enhancement Plugin (TG YUIO HJKL) 🌟\n\nIs there anything better in this world than moving the cursor with Vim mode's HJKL? There must be! That's the acceleration-enhanced smooth editing experience with HJKL! Want to try making your cursor perform high-end moves around a gutter? Install it!\n\n![EditorCursorMovement.gif](./docs/media/EditorCursorMovement.gif)\n\n| Scope       | Edit Module          | Description                      |\n| ----------- | --------------------- | -------------------------------- |\n| Global(Basic) | `CapsLockX + h j k l` | Arrow keys for up, down, left, right |\n| Global(Basic) | `CapsLockX + y o`     | Home End                         |\n| Global(Basic) | `CapsLockX + u i`     | PageUp PageDown                  |\n| Global(Basic) | `CapsLockX + [ ]`     | Shift+Tab and Tab                |\n| Global(Basic) | `CapsLockX + g`       | Enter                            |\n| Global(Advanced) | `CapsLockX + t`     | Delete                           |\n| Global(Advanced) | `CapsLockX + hl`    | Pressing hl together selects the current word |\n| Global(Advanced) | `CapsLockX + kj`    | Pressing kj together selects the current line |\n| Global(Advanced) | `CapsLockX + h + t` | Shift then Delete: can replace Backspace in most cases |
# 媒体键模块\r\n\r\n| 作用于 | 媒体键模块        | 说明                                        |\r\n| ------ | ----------------- | ------------------------------------------- |\r\n| 全局   | `CapsLockX + F1`  | 打开：我的电脑                              |\r\n| 全局   | `CapsLockX + F2`  | 打开：计算器                                |\r\n| 全局   | `CapsLockX + F3`  | 打开：浏览器主页                            |\r\n| 全局   | `CapsLockX + F4`  | 打开：媒体库（默认是 Windows Media Player） |\r\n| 全局   | `CapsLockX + F5`  | 播放：暂停/播放                             |\r\n| 全局   | `CapsLockX + F6`  | 播放：上一首                                |\r\n| 全局   | `CapsLockX + F7`  | 播放：下一首                                |\r\n| 全局   | `CapsLockX + F8`  | 播放：停止                                  |\r\n| 全局   | `CapsLockX + F9`  | 音量加                                      |\r\n| 全局   | `CapsLockX + F10` | 音量减                                      |\r\n| 全局   | `CapsLockX + F11` | 静音                                        |\r=| Applied to | Media Key Module    | Description                                         |\n| ---------- | ------------------- | --------------------------------------------------- |\n| Global     | `CapsLockX + F1`    | Open: My Computer                                   |\n| Global     | `CapsLockX + F2`    | Open: Calculator                                    |\n| Global     | `CapsLockX + F3`    | Open: Browser Home Page                             |\n| Global     | `CapsLockX + F4`    | Open: Media Library (default is Windows Media Player) |\n| Global     | `CapsLockX + F5`    | Play: Pause/Play                                    |\n| Global     | `CapsLockX + F6`    | Play: Previous Track                                |\n| Global     | `CapsLockX + F7`    | Play: Next Track                                    |\n| Global     | `CapsLockX + F8`    | Play: Stop                                          |\n| Global     | `CapsLockX + F9`    | Volume Up                                           |\n| Global     | `CapsLockX + F10`   | Volume Down                                         |\n| Global     | `CapsLockX + F11`   | Mute                                                |
# JavaScript 计算 (建议安装 NodeJS )\r\n\r\n| 作用于 | 按键            | 效果                                   |\r\n| ------ | --------------- | -------------------------------------- |\r\n| 全局   | `CapsLockX + -` | 计算当前选区 JavaScript 表达式，并替换 |\r\n| 全局   | `CapsLockX + \e` | 计算当前选区 JavaScript 表达式，并替换 |\r=| Applies to | Key              | Effect                                    |\n| ---------- | ---------------- | ------------------------------------------ |\n| Global     | `CapsLockX + -`  | Evaluate selected JavaScript expression and replace |\n| Global     | `CapsLockX + \e`  | Evaluate selected JavaScript expression and replace |
# 模拟鼠标插件（ WASD QERF ）\r\n\r\n> 一直以来，我总是以键盘控自居，应该是在从前做模型的时候伤到了手指关节开始，成为键盘重度用户的。各种键盘加速工具，主动去记住各种快捷键，力求少用鼠标，甚至去学习了 vim 和 emacs。但是，很多时候，鼠标是无可替代的，尤其是在图形界面大行其道时候。\r\n\r\n—— 以上是来自 [SimClick 模拟点击](https://github.com/rywiki/simclick) 作者的一段话，这是一款以网格细分方式模拟鼠标的作品，可以与本项目互补\r\n\r\n—— 由 [秦金伟](http://rsytes.coding-pages.com/) 推荐\r\n\r\n## 功能\r\n\r\n- 本模块使用按键区：CapsLockX + QWER ASDF\r\n- 非常舒适地使用 WASD QE RF 来模拟【完整的】鼠标功能，相信我，试过这种手感之后，你会喜欢上它的。\r\n- 指针移动时会自动黏附各种按钮、超链接。滚轮的指数级增长的加速度滚动机制使你再也不惧怕超级长的文章和网页。\r\n- 效果如图：\r\n  ![CLX-Mouse.gif](./docs/media/CLX-Mouse.gif)\r\n\r\n## 使用方法如下\r\n\r\n| 作用于 | 按键                                  | 说明                                     |\r\n| ------ | ------------------------------------- | ---------------------------------------- |\r\n| 全局   | `CapsLockX + w a s d`                 | 鼠标移动（上下左右）                     |\r\n| 全局   | `CapsLockX + ad`                      | 将 HJKL 键切换到滚轮模式（上下左右滚动） |\r\n| 全局   | `CapsLockX + r f`                     | 垂直滚轮（上下）                         |\r\n| 全局   | `CapsLockX + Shift + r f`             | 水平滚轮（左右）                         |\r\n| 全局   | `CapsLockX + Ctrl + Alt + r f`        | 垂直滚轮自动滚动（上 下）                |\r\n| 全局   | `CapsLockX + Ctrl + Alt + Shift+ r f` | 水平滚轮自动滚动（左 右）                |\r\n| 全局   | `CapsLockX + rf`                      | rf 同时按相当于鼠标中键                  |\r\n| 全局   | `CapsLockX + e`                       | 鼠标左键                                 |\r\n| 全局   | `CapsLockX + q`                       | 鼠标右键                                 |\r\n\r\n## 操作细节\r\n\r\n快速连按 AD 步进\r=# Simulate Mouse Plugin (WASD QERF)\n\n> I have always considered myself a keyboard enthusiast, probably starting from when I injured my finger joints while making models and became a heavy keyboard user. I actively remember various shortcut keys using all sorts of keyboard acceleration tools, striving to use the mouse less, even learning vim and emacs. However, many times the mouse is irreplaceable, especially when graphical interfaces prevail.\n\n—— The above is a statement by the author of [SimClick simulation click](https://github.com/rywiki/simclick), a work that simulates the mouse through grid subdivision, and can complement this project\n\n—— Recommended by [Qin Jinwei](http://rsytes.coding-pages.com/)\n\n## Features\n\n- This module uses the key area: CapsLockX + QWER ASDF\n- Use WASD QE RF to comfortably simulate a [complete] mouse function. Trust me, once you try this feel, you will love it.\n- The pointer will automatically snap to various buttons and hyperlinks while moving. The exponential growth acceleration scrolling mechanism of the wheel makes you no longer fear super long articles and web pages.\n- The effect is as shown in the picture:\n  ![CLX-Mouse.gif](./docs/media/CLX-Mouse.gif)\n\n## Usage is as follows\n\n| Apply to | Key                                     | Description                               |\n| -------- | --------------------------------------- | ----------------------------------------- |\n| Global   | `CapsLockX + w a s d`                   | Mouse movement (up, down, left, right)    |\n| Global   | `CapsLockX + ad`                        | Switch HJKL keys to scroll wheel mode (up, down, left, right scroll) |\n| Global   | `CapsLockX + r f`                       | Vertical scroll wheel (up, down)          |\n| Global   | `CapsLockX + Shift + r f`               | Horizontal scroll wheel (left, right)     |\n| Global   | `CapsLockX + Ctrl + Alt +
# 窗口增强插件 (CLX + 1234567890 ZXCV)\r\n\r\n## 功能简述\r\n\r\n用好 Win 10 自带的 10 个虚拟桌面豪华配置、多显示器自动排列窗口、半透明置顶、（注：任务栏和 AltTab 相关功能暂不兼容 Win11，窗口排列功能正常。）\r\n\r\n1. 窗口切换：`CapsLockX + [Shift] + Z`\r\n2. 窗口关闭：`CapsLockX + [Shift] + X`\r\n3. 窗口排列：`CapsLockX + [Shift] + C`\r\n4. 窗口置顶：`CapsLockX + [Shift] + V`\r\n5. 左手窗口管理：在 `Alt + Tab` 的界面，用 `WASD` 切换窗口，`X` 关掉窗口。\r\n6. 高效使用虚拟桌面：`CapsLockX + 0123456789` 切换、增减虚拟桌面，加上 `Shift` 键可以转移当前窗口\r\n7. 虚拟机与远程桌面快速脱离：双击左边 `Shift + Ctrl + Alt`。\r\n\r\n## 效果图\r\n\r\n- Alt + Tab 管理窗口增强\r\n  ![02-插件-窗口增强_Alt+Tab+WASD管理窗口.gif](./docs/media/02-插件-窗口增强_Alt+Tab+WASD管理窗口.gif)\r\n- CapsLockX + C 一键排列窗口（这 GIF 是旧版本录的看起来比较卡，新版本优化过 API 就不卡了）\r\n  ![02-插件-窗口增强_一键排列窗口.gif](./docs/media/02-插件-窗口增强_一键排列窗口.gif)\r\n\r\n## 使用方法如下 ( Alt+Tab 与 CapsLockX )\r\n\r\n| 作用域       | 窗口增强模块                          | 说明                                       |\r\n| ------------ | ------------------------------------- | ------------------------------------------ |\r\n| Alt+Tab 界面 | `Q E`                                 | 左右切换多桌面                             |\r\n| Alt+Tab 界面 | `W A S D`                             | 上下左右切换窗口选择                       |\r\n| Alt+Tab 界面 | `X C`                                 | 关闭选择的窗口（目前 X 和 C 没有区别）     |\r\n| Win+Tab 视图 | `Alt + W A S D`                       | 切换窗口选择                               |\r\n| 全局         | `Win + [Shift] + B`                   | 定位到托盘任务(windows 系統自帯熱鍵)       |\r\n| 全局         | `Win + [Shift] + T`                   | 定位到任務栏任务(windows 系統自帯熱鍵)     |\r\n| 全局         | `Win + Shift + hjkl`                  | 在窗口之间按方向切换焦点                   |\r\n| 任务栏       | `Ctrl + W 或 Delete`                  | 在托盘图标或任务栏任务上，选择退出按钮     |\r\n| 全局         | `CapsLockX + 1 2 ... 9 0`             | 切换到第 1 .. 12 个桌面                    |\r\n| 全局         | `CapsLockX + Shift + 1 2 ... 9 0 - \e` | 把当前窗口移到第 n 个桌面(如果有的话)      |\r\n| 全局         | `CapsLockX + Alt + Backspace`         | 删除当前桌面（会把所有窗口移到上一个桌面） |\r\n| 全局         | `CapsLockX + C`                       | 快速排列当前桌面的窗口                     |\r\n| 全局         | `CapsLockX + Ctrl + C`                | 快速排列当前桌面的窗口（包括最小化的窗口） |\r\n| 全局         | `CapsLockX + Shift + C`               | 快速堆叠当前桌面的窗口                     |\r\n| 全局         | `CapsLockX + Shift + Ctrl + C`        | 快速堆叠当前桌面的窗口（包括最小化的窗口） |\r\n| 全局         | `CapsLockX + Z`                       | 循环切到最近使用的窗口                     |\r\n| 全局         | `CapsLockX + Shift + Z`               | 循环切到最不近使用的窗口                   |\r\n| 全局         | `CapsLockX + X`                       | 关掉当前标签页 Ctrl+W                      |\r\n| 全局         | `CapsLockX + Shift + X`               | 关掉当前窗口 Alt+F4                        |\r\n| 全局         | `CapsLockX + V`                       | 让窗口透明                                 |\r\n| 全局         | `CapsLockX + Shift + V`               | 让窗口保持透明（并置顶）                   |\r\n| 任意窗口     | `双击左边 Shift+Ctrl+Alt`             | 后置当前窗口， \\* 见下方注                 |\r\n\r\n\\*注： 双击左边 Shift+Ctrl+Alt 设计用于远程桌面与虚拟机，使其可与本机桌面窗口同时显示。\r\n例如 mstsc.exe、TeamViewer、VirtualBox、HyperV、VMWare 等远程桌面或虚拟机程序，配合 CapsLockX + Shift + V 透明置顶功能，让你在 Windows 的界面上同时使用 Linux 界面或 MacOS 界面再也不是难题。\r\n\r\n此处借用 [@yangbin9317 的评论](https://v2ex.com/t/772052#r_10458792)\r\n\r\n> 以 CapsLock 为抓手,打通底层逻辑,拉齐 Windows 和 Linux WM,解决了 Windows 难用的痛点\r\n\r\n(20220313) 对于两端都是 Windows 的情况，也可以考虑使用 [RemoteApp Tool - Kim Knight](http://www.kimknight.net/remoteapptool) 来代替远程桌面。\r=# Window Enhancement Plugin (CLX + 1234567890 ZXCV)\n\n## Brief Overview\n\nUtilize the luxurious configuration of Win 10's 10 built-in virtual desktops, automatic window arrangement for multiple displays, semi-transparent topmost windows. (Note: Taskbar and AltTab related features are temporarily incompatible with Win11, window arrangement functions normally.)\n\n1. Window Switch: `CapsLockX + [Shift] + Z`\n2. Window Close: `CapsLockX + [Shift] + X`\n3. Window Arrangement: `CapsLockX + [Shift] + C`\n4. Window Topmost: `CapsLockX + [Shift] + V`\n5. Left-hand window management: Use `WASD` to switch windows, `X` to close windows in the `Alt + Tab` interface.\n6. Efficient use of virtual desktops: `CapsLockX + 0123456789` to switch, add or remove virtual desktops, use `Shift` to transfer the current window.\n7. Quick detach from virtual machine and remote desktop: double-click left `Shift + Ctrl + Alt`.\n\n## Example Images\n\n- Alt + Tab enhanced window management\n  ![02-Plugin-WindowEnhancement_Alt+Tab+WASDWindowManagement.gif](./docs/media/02-Plugin-WindowEnhancement_Alt+Tab+WASDWindowManagement.gif)\n- CapsLockX + C one-click window arrangement (This GIF was recorded with an older version and appears laggy; the newest version has optimized the API and it's smooth.)\n  ![02-Plugin-WindowEnhancement_OneClickArrangeWindows.gif](./docs/media/02-Plugin-WindowEnhancement_OneClickArrangeWindows.gif)\n\n## Usage (Alt+Tab and CapsLockX)\n\n| Scope        | Window Enhancement Module              | Description                                    |\n| ------------ | ------------------------------------- | --------------------------------------------- |\n| Alt
# 快捷输入\r\n\r\n| 模式 | 快捷输入 | 说明                                            |\r\n| ---- | -------- | ----------------------------------------------- |\r\n| 全局 | `#D#`    | 日期输入：`(20220217)`                          |\r\n| 全局 | `#T#`    | 时间输入：`(20220217.220717)`                   |\r\n| 全局 | `#DT#`   | 日期时间输入：`2022-02-17 22:07:33`             |\r\n| 全局 | `#NPW#`  | 随机输入数字密码如： `7500331260229289`         |\r\n| 全局 | `#PW#`   | 随机输入数字字母密码如： `yyCTCNYodECTLr2h`     |\r\n| 全局 | `#WPW#`  | 随机输入数字字母密码如： `FtD5BB1m5H98eY7Y`     |\r\n| 全局 | `#SPW#`  | 随机输入数字字母符号密码如： `/})y+xK]z~>XKQ+p` |\r=| Mode  | Quick Input | Description                                         |\n| ----- | ----------- | --------------------------------------------------- |\n| Global| `#D#`       | Date input: `(20220217)`                            |\n| Global| `#T#`       | Time input: `(20220217.220717)`                     |\n| Global| `#DT#`      | Date and time input: `2022-02-17 22:07:33`          |\n| Global| `#NPW#`     | Random input of numeric password like: `7500331260229289` |\n| Global| `#PW#`      | Random input of alphanumeric password like: `yyCTCNYodECTLr2h` |\n| Global| `#WPW#`     | Random input of alphanumeric password like: `FtD5BB1m5H98eY7Y` |\n| Global| `#SPW#`     | Random input of alphanumeric-symbol password like: `/})y+xK]z~>XKQ+p` |
# 锁屏自动息屏\r\n\r\n按 Win + L 锁屏时，立即关闭屏幕，适用于准备睡觉的时候自动把电脑屏幕关掉，不让它在睡觉的时候刺眼……\r\n按 Win + Alt + L 立即关闭屏幕，适用于准备睡觉的时候把电脑屏幕关掉，不让它在睡觉的时候刺眼……\r\n\r=# Auto Screen Off When Locked\n\nPress Win + L to lock the screen and immediately turn off the display, suitable for turning off the computer screen automatically when preparing to sleep, so it won't be glaring while sleeping…\nPress Win + Alt + L to immediately turn off the display, suitable for turning off the computer screen when preparing to sleep, so it won't be glaring while sleeping…
# 番茄时钟\r\n\r\n25 分钟固定循环休息提醒。\r\n\r\n使用 `CapsLockX + ,` 打开配置，然后修改 EnableScheduleTasks\e1 即可启用本插件。\r\n\r\n- 使用番茄报时（00 分和 30 分播放工作铃声，每小时的 25 分和 55 分播放休息铃声）（需要先开启定时任务）\r\n\r\n  ```ini\r\n  UseTomatoLife\e1\r\n  ```\r\n\r\n- 使用番茄报时时，自动切换桌面（使用番茄报时时，自动切换桌面（休息桌面为 1，工作桌面为 2）\r\n\r\n  ```ini\r\n  UseTomatoLifeSwitchVirtualDesktop\e1\r\n  ```\r\n\r\n注：如果只需要声音而不需要自动切换桌面的话，也可试试这款 Chrome 插件 [Tomato Life - Chrome 网上应用店](https://chrome.google.com/webstore/detail/25min-tomato-life/kkacpbmkhbljebmpcopjlgfgbgeokbhn)\r\n\r\n注注: 本插件已经分离出一个独立项目，如果你喜欢番茄工作法的话可以参见雪星的 tomato-life 项目： [snomiao/tomato-life](https://github.com/snomiao/tomato-life)\r=# Pomodoro Timer\n\n25-minute fixed cycle break reminder.\n\nUse `CapsLockX + ,` to open the configuration, then modify EnableScheduleTasks\e1 to enable this plugin.\n\n- Use the Pomodoro time announcement (plays a work ringtone at 00 and 30 minutes, and plays a break ringtone at 25 and 55 minutes) (scheduling tasks need to be enabled first)\n\n  ```ini\n  UseTomatoLife\e1\n  ```\n\n- Automatically switch desktops when using the Pomodoro time announcement (rest desktop is 1, work desktop is 2)\n\n  ```ini\n  UseTomatoLifeSwitchVirtualDesktop\e1\n  ```\n\nNote: If you only need sound without automatic desktop switching, you can try this Chrome plugin [Tomato Life - Chrome Web Store](https://chrome.google.com/webstore/detail/25min-tomato-life/kkacpbmkhbljebmpcopjlgfgbgeokbhn)\n\nNote: This plugin has been separated into an independent project. If you like the Pomodoro Technique, you can refer to the snow star's tomato-life project: [snomiao/tomato-life](https://github.com/snomiao/tomato-life)
# 帮助模块\n\n如果你想学习如何开发 CapsLockX 的插件，请：\n\n1. 打开 `Modules/@Help.ahk` ， 你可以了解到 CapsLockX 插件的基本格式\n2. 将它复制一份，命名为你自己的插件名称\n3. 将它本来的功能改成你自己需要的功能，插件的开发就完成啦！\n\n## 本模块功能见下\n\n| 作用于 | 按键                  | 功能                             |\n| ------ | --------------------- | -------------------------------- |\n| 全局   | CapsLockX + /         | 临时显示热键提示                 |\n| 全局   | CapsLockX + Alt + /   | 🔗 打开 CapsLockX 的完整文档页面 |\n| 全局   | CapsLockX + Shift + / | 🕷 提交 bug、建议等               |=# Help Module\n\nIf you want to learn how to develop plugins for CapsLockX, please:\n\n1. Open `Modules/@Help.ahk`, where you can understand the basic format of a CapsLockX plugin.\n2. Copy it and name it with your own plugin name.\n3. Change its original functionality to the functionality you need, and the plugin development is complete!\n\n## See below for the function of this module\n\n| Applies To | Key                     | Function                                 |\n| ---------- | ----------------------- | ---------------------------------------- |\n| Global     | CapsLockX + /           | Temporarily display hotkey hints         |\n| Global     | CapsLockX + Alt + /     | 🔗 Open the full documentation page of CapsLockX |\n| Global     | CapsLockX + Shift + /   | 🕷 Submit bugs, suggestions, etc.         |
# Anki 增强模块\n\nAnki 操作增强\n\n## 常用功能/特性\n\n1. 使用 WASD 或 HJKL 来快速连续地（并且可以撤销）切换记忆卡片\n2. 在 Excel 制作一个单词列表，共 2 列， 全选复制，然后在 Anki 中按 Alt + i 来快速导入单词列表。\n3. 简化 4 个选项为 3 个方向键，左易，下中，右难，上撤销。\n4. 可配合手柄使用，使用 XPadder 配置手柄摇杆映射到方向键即可。效果请见 bilibili [中二雪星怎背词 - 手柄怎么可以不用来背单词！](https://www.bilibili.com/video/av8456838/)\n\n## 说明\n\n| 模式                 | Anki 增强模块  | 说明                                                        |\n| -------------------- | :------------: | ----------------------------------------------------------- |\n| 在 Anki-学习界面     | `w 或 k 或 ↑`  | 按下\e撤销，松开显示答案                                     |\n| 在 Anki-学习界面     | `a 或 h 或 ←`  | 按下\e顺利，松开显示答案                                     |\n| 在 Anki-学习界面     | `s 或 j 或 ↓`  | 按下\e一般，松开显示答案                                     |\n| 在 Anki-学习界面     | `d 或 l 或 →`  | 按下\e生疏，松开显示答案                                     |\n| 在 Anki-学习界面     |      `q`       | 返回上个界面                                                |\n| 在 Anki-学习界面     |      `c`       | 添加新卡片                                                  |\n| 在 Anki-学习界面     | `1 或 NumPad1` | 困难（原键位）                                              |\n| 在 Anki-学习界面     | `2 或 NumPad2` | 生疏（原键位）                                              |\n| 在 Anki-学习界面     | `3 或 NumPad3` | 一般（原键位）                                              |\n| 在 Anki-学习界面     | `4 或 NumPad4` | 顺利（原键位）                                              |\n| 在 Anki-学习界面     | `5 或 NumPad5` | 撤销                                                        |\n| 在 Anki-学习界面     | `6 或 NumPad6` | 暂停卡片                                                    |\n| 在 Anki-学习界面     |   `Alt + i`    | 快速导入剪贴版的内容（按 Tab 分割） / 比如可以从 Excel 复制 |\n| 在 Anki-添加卡片界面 |   `Alt + s`    | 按下 添加 按钮                                              |=# Anki Enhancement Module\n\nAnki Operation Enhancement\n\n## Common Features\n\n1. Use WASD or HJKL to quickly and continuously (and with undo capabilities) switch flashcards.\n2. Create a word list in Excel with 2 columns, copy the entire selection, and then press Alt + i in Anki to quickly import the word list.\n3. Simplify four options into three direction keys: left-easy, down-moderate, right-hard, up-undo.\n4. Can be used with a game controller by configuring the joystick mapping to direction keys using XPadder. See the result on bilibili [中二雪星怎背词 - 手柄怎么可以不用来背单词！](https://www.bilibili.com/video/av8456838/)\n\n## Description\n\n| Mode                  | Anki Enhancement Module | Description                                                  |\n| --------------------- | :---------------------: | ------------------------------------------------------------ |\n| In Anki-Learning Mode | `w or k or ↑`          | Press\eUndo, Release to show answer                           |\n| In Anki-Learning Mode | `a or h or ←`          | Press\eEasy, Release to show answer                           |\n| In Anki-Learning Mode | `s or j or ↓`          | Press\eModerate, Release to show answer                       |\n| In Anki-Learning Mode | `d or l or →`          | Press\eHard, Release to show answer                           |\n| In Anki-Learning Mode | `q`                    | Return to the previous interface                             |\n| In Anki-Learning Mode | `c`                    | Add new card                                                 |\n| In Anki-Learning Mode | `1 or NumPad1`         | Hard (original key)                                          |\n| In Anki-Learning Mode | `2 or NumPad2`         | Difficult (original key)                                     |\n| In Anki-Learning Mode | `3 or NumPad3`         | Moderate (original key)                                      |\n| In Anki-Learning Mode | `4 or NumPad4`         | Easy (original key)                                          |\n| In Anki-Learning Mode | `5 or NumPad5`         | Undo                                                         |\n| In Anki-Learning Mode | `6 or NumPad6`         | Suspend card                                                 |\n| In Anki-Learning Mode | `Alt + i`              | Quickly import clipboard content (split by Tab), e.g., copy from Excel |\n| In Anki-Add Card Mode | `Alt + s`              | Press Add button                                             |
# OneNote 2016 - 2019 增强\n\n朴素地增强 OneNote 2016 - 2019 的键盘操作，便捷地使用键盘来：换笔，制作链接，整理页面，调整视图……\n\n## 雪星喵常用功能\n\n1. 做日志的时候，先在笔记页面 `Alt + T` 给笔记标题添加日期标签（用于将来搜索），然后全局 `Win + Shift + N` 在 OneNote 搜索带有 今日标签 的所有笔记，用来方便地检索你今日的：恋爱日记、训练日志、每日书单、项目日报……总之在 OneNote 写日记就很方便了，一按就出来，不用找 XD\n2. 选一个词按 `Alt + K` ，会把所有相关的页面链接列到这个词的下方，用来做索引目录，把你的 OneNote 织成一张网。\n3. 新建一个笔记，改名叫 `我的剪贴板`，然后在复制文本、图片的时候，CLX 会帮你自动追加到这个笔记，用于方便地收集资料或摘抄文章。\n4. Alt + 1234567 层级折叠，轻松地在不同抽象层次的思考上切换。\n\n## 按键分布设计（开发中）\n\n| 按键描述                | 作用                    | 备注       |\n| ----------------------- | ----------------------- | ---------- |\n| `所有 OneNote 自带热键` | 原功能                  |            |\n| `按一下 Alt 再按别的`   | 触发 OneNote 原菜单功能 |            |\n| `Alt + 1234567`         | 大纲折叠展开到 1-7 层级 |            |\n| `Alt + qwe asd r`       | 工具、换笔、视图        |            |\n| `Alt + f`               | 查找标签                |            |\n| `Alt + -\e`              | 公式相关                |            |\n| `Alt + m`               | 移动笔记、分区          |            |\n| `Alt + hjkl`            | 各种链接功能            |            |\n| `Alt + zxcv`            | 高级复制粘贴            | 细节开发中 |\n| `Alt + /`               | 热键帮助、提示          | 开发中     |\n| `F2 F3`                 | 重命名、查找笔记        |            |\n\n## 详细按键表 / CheatSheet\n\n| 作用于                   | 格式热键                     | 功能                                                                      |\n| ------------------------ | ---------------------------- | ------------------------------------------------------------------------- |\n| 全局                     | `Win + Alt + N`              | 打开快速笔记第一页（弥补 OneNote 原本没有像 Notion 一样的首页概念的不足） |\n| 全局                     | `Win + Shift + N`            | 打开 OneNote 并精确搜索今日标签                                           |\n| OneNote2019              | `Alt + 1234567`              | 大纲：大纲折叠展开到那层（强烈推荐，超好用）                              |\n| OneNote2019              | `F2`                         | 整理：重命名笔记                                                          |\n| OneNote2019              | `Shift + F2`                 | 整理：重命名分区                                                          |\n| OneNote2019              | `Alt + m`                    | 整理：移动笔记                                                            |\n| OneNote2019              | `Alt + Shift + m`            | 整理：移动分区                                                            |\n| OneNote2019              | `Ctrl + n`                   | 整理：新建笔记                                                            |\n| OneNote2019              | `Ctrl + Alt + n`             | 整理：在当前笔记下方新建笔记                                              |\n| OneNote2019              | `Alt + Delete`               | 整理：快速删除当前页面                                                    |\n| OneNote2019              | `Ctrl + s`                   | 整理：立即同步此笔记本                                                    |\n| OneNote2019              | `Ctrl + w`                   | 整理：关闭窗口                                                            |\n| OneNote2019              | `Shift + Delete`             | 编辑：快速删除当前行                                                      |\n| OneNote2019              | `Alt + -`                    | 编辑：自动 2 维化公式                                                     |\n| OneNote2019              | `Alt + k`                    | 编辑：⭐🔗 展开当前关键词的相关页面链接（快速关键词一对多链接）           |\n| OneNote2019              | `Alt + n`                    | 样式：切换页面为无色背景                                                  |\n| OneNote2019              | `Alt + v`                    | 样式：改变文字背景色                                                      |\n| OneNote2019              | `Alt + q`                    | 工具：拖动                                                                |\n| OneNote2019              | `Alt + w`                    | 工具：套锁                                                                |\n| OneNote2019              | `Alt + e`                    | 工具：橡皮                                                                |\n| OneNote2019              | `Alt + s`                    | 工具：输入                                                                |\n| OneNote2019              | `Alt + a`                    | 工具：换到第 2 支笔                                                       |\n| OneNote2019              | `Alt + d`                    | 工具：打开换笔盘（然后可可方向键选笔 （目前全屏无效）                     |\n| OneNote2019              | `Alt + d -> 1234567`         | 工具：打开换笔盘（然后选第 1 行第 x 支笔） （目前全屏无效）               |\n| OneNote2019              | `Alt + d -> Shift + 1234567` | 工具：打开换笔盘（然后选第 2 行第 x 支笔） （目前全屏无效）               |\n| OneNote2019              | `Alt + r`                    | 视图：缩放到原始大小                                                      |\n| OneNote2019              | `Alt + y`                    | 视图：缩放到页面宽度                                                      |\n| OneNote2019              | `^!+- 或 ^!+\e`               | 视图：缩小页面 或 放大页面                                                |\n| OneNote2019              | `Alt + f`                    | 视图：搜索标记                                                            |\n| OneNote2019              | `Alt + t`                    | 编辑：给笔记增加日期标签，例如： (20220717)                               |\n| OneNote2019              | `Ctrl + Shift + c`           | 编辑：复制（纯文本）                                                      |\n| OneNote2019              | `Ctrl + Shift + v`           | 编辑：粘贴（纯文本）                                                      |\n| OneNote2019 创建链接窗口 | `Alt + s`                    | 编辑：复制当前所有搜索结果页面的链接                                      |\n| OneNote2019 创建链接窗口 | `Alt + Shift + s`            | 编辑：复制当前所有搜索结果页面的链接并粘贴                                |\n| OneNote2019 剪贴板笔记   | `Ctrl + C`                   | 编辑：⭐ 追加复制的内容到名称中含有 "Clipboard" 或 "剪贴板" 的笔记        |=# OneNote 2016 - 2019 Enhancement\n\nEnhance OneNote 2016 - 2019 keyboard operations simply, conveniently use the keyboard to: switch pen, create links, organize pages, adjust views...\n\n## SnowStarMeow Commonly Used Features\n\n1. When making logs, first use `Alt + T` on the note page to add a date label to the note title (for future search), then globally use `Win + Shift + N` to search OneNote for all notes with today's tag, making it easy to retrieve your daily: love diary, training log, daily book list, project daily report... In short, writing a diary in OneNote becomes very convenient, just press a button and it comes out, no need to find XD.\n2. Select a word and press `Alt + K`, it will list all related page links below this word, used for index directories, weaving your OneNote into a network.\n3. Create a new note, rename it to `My Clipboard`, then when copying text or pictures, CLX will automatically append it to this note, making it convenient to collect materials or excerpt articles.\n4. Alt + 1234567 level folding, easily switch between different levels of abstraction in thought.\n\n## Key Distribution Design (Under Development)\n\n| Key Description          | Function                               | Notes     |\n| ------------------------ | --------------------------------------- | --------- |\n| `All OneNote Built-in Hotkeys` | Original Function                        |           |\n| `Press Alt then Another`   | Trigger OneNote Original Menu Function   |           |\n| `Alt + 1234567`          | Outline folding/unfolding to 1-7 levels |           |\n| `Alt + qwe asd r`        | Tools, switch pen, view                 |           |\n| `Alt + f`                | Search tags                             |           |\n| `Alt + - \e`              | Formula related                         |           |\n| `Alt + m`                | Move notes, sections                    |           |\n| `Alt + hjkl`             | Various link functions                  |           |\n| `Alt + zxcv`             | Advanced copy-paste                     | Details in development |\n| `Alt + /`                | Hotkey Help, Tips                       | In development |\n| `F2 F3`                  | Rename, find notes                      |           |\n\n## Detailed Key Table / CheatSheet\n\n| Applied To                | Format Hotkey                 | Function                                                                    |\n| ------------------------- | ----------------------------- | --------------------------------------------------------------------------- |\n| Global                    | `Win + Alt + N`               | Open the first page of quick notes (compensating for OneNote's lack of a homepage concept like Notion) |\n| Global                    | `Win + Shift + N`             | Open OneNote and precisely search today's tag                               |\n| OneNote2019               | `Alt + 1234567`               | Outline: Outline folding/unfolding to that level (highly recommended, super useful) |\n| OneNote2019               | `F2`                          | Organize: Rename note                                                       |\n| OneNote2019               | `Shift + F2`                  | Organize: Rename section                                                    |\n| OneNote2019               | `Alt + m`                     | Organize: Move note                                                         |\n| OneNote2019               | `Alt + Shift + m`             | Organize: Move section                                                      |\n| OneNote2019               | `Ctrl + n`                    | Organize: Create a new note                                                 |\n| OneNote2019               | `Ctrl + Alt + n`              | Organize: Create a new note below the current note                          |\n| OneNote2019               | `Alt + Delete`                | Organize: Quickly delete the current page                                   |\n| OneNote2019               | `Ctrl + s`                    | Organize: Sync this notebook immediately                                    |\n| OneNote2019               | `Ctrl + w`                    | Organize: Close window                                                      |\n| OneNote2019               | `Shift + Delete`              | Edit: Quickly delete the current line                                       |\n| OneNote2019               | `Alt + -`                     | Edit: Automatic 2D formula                                                  |\n| OneNote2019               | `Alt + k`                     | Edit: ⭐🔗 Expand related page links of the current keyword (fast one-to
# 讯飞输入法悬浮窗插件\n\n## 用法\n\n| 作用于 |     按键      | 功能说明              |\n| ------ | :-----------: | --------------------- |\n| 全局   | Win + Alt + H | 启动/切换讯飞语音输入 |\n\n## 注\n\n1. 若没有安装讯飞语音则会自动询问是否引导下载安装\n\n## 效果如下图\n\n![App-讯飞语音输入法悬浮窗演示.gif](./docs/media/App-讯飞语音输入法悬浮窗演示.gif)=# iFlytek Input Method Floating Plugin\n\n## Usage\n\n| Applied To |     Keys      | Function Description    |\n| ---------- | :-----------: | ----------------------- |\n| Global     | Win + Alt + H | Launch/Switch iFlytek Voice Input |\n\n## Note\n\n1. If iFlytek Voice is not installed, it will automatically ask whether to guide the download and installation. \n\n## The effect is as shown in the picture below\n\n![App-iFlytek Voice Input Method Floating Window Demonstration.gif](./docs/media/App-iFlytek Voice Input Method Floating Window Demonstration.gif)
# CLX - Brainstorm 大脳风暴\n\n任何時間，任何輸入框，按下 `CLX+b` 鍵，開始使用 AI 輔助輸入。\n\n## 按键分布（开发中）\n\n| 按键描述        | 作用                                                 | 备注 |\n| --------------- | ---------------------------------------------------- | ---- |\n| CLX + b         | 自動複製当前选中内容，輸入指令，让 AI 辅助你的輸入   |      |\n| CLX + Alt + b   | 配置激活碼（目前只有免費方案，将来可能加入功能増強） |      |\n| CLX + Shift + b | 査看使用額度                                         |      |\n\n## Protips:\n\n### 随時整理会議記録\n\n1. 任何輸入框内，使用 Win+H 來調出語音輸入，然後說出你想要的文字，不用在意語音輸入的準確度，只要說出大概的意思就可以了，\n2. 然後全選按下 `CLX+b`，輸入 `列出要点和待辦事項`，就可以看到 AI 自動幫你整理出來的要點和待辦事項。\n\n### 随時翻訳任何語言到任何語言\n\n1. 任何輸入框内，选中你想要翻譯的文字\n2. 然後全選按下 `CLX+b`，`to chinese:` AI 自動幫你輸入成中文。=# CLX - Brainstorm Cerebral Storm\n\nAnytime, any input box, press `CLX+b` to start using AI-assisted input.\n\n## Key Distribution (under development)\n\n| Key Description      | Function                                              | Note |\n| -------------------- | ----------------------------------------------------- | ---- |\n| CLX + b              | Automatically copy the currently selected content, input instructions, and let AI assist your input |      |\n| CLX + Alt + b        | Configure activation code (currently only a free plan, potential enhancements in the future) |      |\n| CLX + Shift + b      | Check usage quota                                    |      |\n\n## Protips:\n\n### Organize Meeting Notes Anytime\n\n1. Within any input box, use Win+H to bring up voice input, then say what you want to write; accuracy isn't crucial, just convey the general idea.\n2. Then, select all and press `CLX+b`, input `list key points and to-dos`, and you'll see AI automatically organize the key points and tasks.\n\n### Translate Any Language to Any Language Anytime\n\n1. Within any input box, select the text you want to translate.\n2. Then, select all and press `CLX+b`, `to Chinese:` and AI will automatically help you input it in Chinese.
# 编辑增强插件（ TG YUIO HJKL ） 🌟\n\n这个世界上还有比 Vim 模式的 HJKL 移动光标更棒的东西吗？\n这个必须有！\n那就是带加速度的 HJKL 流畅编辑体验！想不想试试让你的光标来一次排水沟过弯的高端操作？装它！\n\n![EditorCursorMovement.gif](./docs/media/EditorCursorMovement.gif)\n\n| 作用域     | Edit 模块             | 说明                             |\n| ---------- | --------------------- | -------------------------------- |\n| 全局(基本) | `CapsLockX + h j k l` | 上下左右 方向键                  |\n| 全局(基本) | `CapsLockX + y o`     | Home End                         |\n| 全局(基本) | `CapsLockX + u i`     | PageUp PageDown                  |\n| 全局(基本) | `CapsLockX + [ ]`     | Shift+Tab 和 Tab                 |\n| 全局(基本) | `CapsLockX + g`       | 回车                             |\n| 全局(进阶) | `CapsLockX + t`       | Delete                           |\n| 全局(进阶) | `CapsLockX + hl`      | hl 一起按选择当前词              |\n| 全局(进阶) | `CapsLockX + kj`      | kj 一起按选择当前行              |\n| 全局(进阶) | `CapsLockX + h + t`   | 移位后删：大部分情况可代替退格键 |=# Editor Enhancement Plugin (TG YUIO HJKL) 🌟\n\nIs there anything better than Vim mode's HJKL cursor movement in this world? There must be! It's the smooth editing experience of HJKL with acceleration! Want to try some advanced cursor maneuvering like drifting through a drainage channel? Install it!\n\n| Scope      | Edit Module           | Description                       |\n| ---------- | --------------------- | --------------------------------- |\n| Global (Basic) | `CapsLockX + h j k l` | Arrow keys                         |\n| Global (Basic) | `CapsLockX + y o`     | Home End                           |\n| Global (Basic) | `CapsLockX + u i`     | PageUp PageDown                    |\n| Global (Basic) | `CapsLockX + [ ]`     | Shift+Tab and Tab                  |\n| Global (Basic) | `CapsLockX + g`       | Enter                              |\n| Global (Advanced) | `CapsLockX + t`     | Delete                             |\n| Global (Advanced) | `CapsLockX + hl`    | Select current word by pressing hl together |\n| Global (Advanced) | `CapsLockX + kj`    | Select current line by pressing kj together |\n| Global (Advanced) | `CapsLockX + h + t` | Shift delete: Can replace Backspace in most cases |
# Surface 笔记本扩充功能键\n\n专治各种笔记本残破键盘\n\n1. 没有右 Ctrl 键？合并 Menu 与 右 Ctrl 键，Menu 当 Ctrl 用 或者 Ctrl 当 Menu 用都可以\n2. 没有 Pause 键？Win + Alt + P 也能打开系统设定信息。\n3. 待补充\n\n| 模式             | 按键                                  | 功能                               |\n| ---------------- | :------------------------------------ | ---------------------------------- |\n| 全局             | Win + Alt + P                         | 相当于 Win + Pause，专为笔记本定制 |\n| 全局             | 右 Ctrl 按一下                        | 会按一下 Menu 弹出菜单             |\n| 全局             | 按住右 Menu                           | 会按住 Ctrl，此时可以与其它键组合  |\n| Win 键模拟启用后 | ] 按住同时，[ 按下                    | 相当于按 Win 键                    |\n| Win 键模拟启用后 | RAlt+\\| 相当于按 Alt+Tab 只不过在右手 |=# Surface Notebook Function Key Expansion\n\nSpecial treatment for all kinds of broken notebook keyboards\n\n1. No right Ctrl key? Merge Menu and right Ctrl keys, you can use Menu as Ctrl or Ctrl as Menu.\n2. No Pause key? Win + Alt + P can also open system settings information.\n3. To be added\n\n| Mode               | Key                                  | Function                           |\n| ------------------ | :----------------------------------- | ---------------------------------- |\n| Global             | Win + Alt + P                        | Equivalent to Win + Pause, customized for notebooks |\n| Global             | Right Ctrl press once                | Press Menu to pop up menu          |\n| Global             | Hold down the right Menu            | Will hold Ctrl, can combine with other keys |\n| After Win key emulation is enabled | ] hold and press [                  | Equivalent to pressing Win key     |\n| After Win key emulation is enabled | RAlt+| Equivalent to pressing Alt+Tab but on the right hand |
# 媒体键模块\n\n| 作用于 | 媒体键模块        | 说明                                        |\n| ------ | ----------------- | ------------------------------------------- |\n| 全局   | `CapsLockX + F1`  | 打开：我的电脑                              |\n| 全局   | `CapsLockX + F2`  | 打开：计算器                                |\n| 全局   | `CapsLockX + F3`  | 打开：浏览器主页                            |\n| 全局   | `CapsLockX + F4`  | 打开：媒体库（默认是 Windows Media Player） |\n| 全局   | `CapsLockX + F5`  | 播放：暂停/播放                             |\n| 全局   | `CapsLockX + F6`  | 播放：上一首                                |\n| 全局   | `CapsLockX + F7`  | 播放：下一首                                |\n| 全局   | `CapsLockX + F8`  | 播放：停止                                  |\n| 全局   | `CapsLockX + F9`  | 音量加                                      |\n| 全局   | `CapsLockX + F10` | 音量减                                      |\n| 全局   | `CapsLockX + F11` | 静音                                        |=| Applies to | Media Key Module  | Description                                |\n|------------|-------------------|--------------------------------------------|\n| Global     | `CapsLockX + F1`  | Open: My Computer                          |\n| Global     | `CapsLockX + F2`  | Open: Calculator                           |\n| Global     | `CapsLockX + F3`  | Open: Browser Homepage                     |\n| Global     | `CapsLockX + F4`  | Open: Media Library (Default is Windows Media Player) |\n| Global     | `CapsLockX + F5`  | Play: Pause/Play                           |\n| Global     | `CapsLockX + F6`  | Play: Previous Track                       |\n| Global     | `CapsLockX + F7`  | Play: Next Track                           |\n| Global     | `CapsLockX + F8`  | Play: Stop                                 |\n| Global     | `CapsLockX + F9`  | Volume Up                                  |\n| Global     | `CapsLockX + F10` | Volume Down                                |\n| Global     | `CapsLockX + F11` | Mute                                       |
# JavaScript 计算 (建议安装 NodeJS )\n\n| 作用于 | 按键            | 效果                                   |\n| ------ | --------------- | -------------------------------------- |\n| 全局   | `CapsLockX + -` | 计算当前选区 JavaScript 表达式，并替换 |\n| 全局   | `CapsLockX + \e` | 计算当前选区 JavaScript 表达式，并替换 |=# JavaScript Calculation (NodeJS Installation Recommended)\n\n| Context | Key            | Effect                                        |\n| ------- | -------------- | --------------------------------------------- |\n| Global  | `CapsLockX + -` | Evaluate the currently selected JavaScript expression and replace |\n| Global  | `CapsLockX + \e` | Evaluate the currently selected JavaScript expression and replace |
# 模拟鼠标插件（ WASD QERF ）\n\n> 一直以来，我总是以键盘控自居，应该是在从前做模型的时候伤到了手指关节开始，成为键盘重度用户的。各种键盘加速工具，主动去记住各种快捷键，力求少用鼠标，甚至去学习了 vim 和 emacs。但是，很多时候，鼠标是无可替代的，尤其是在图形界面大行其道时候。\n\n—— 以上是来自 [SimClick 模拟点击](https://github.com/rywiki/simclick) 作者的一段话，这是一款以网格细分方式模拟鼠标的作品，可以与本项目互补\n\n—— 由 [秦金伟](http://rsytes.coding-pages.com/) 推荐\n\n## 功能\n\n- 本模块使用按键区：CapsLockX + QWER ASDF\n- 非常舒适地使用 WASD QE RF 来模拟【完整的】鼠标功能，相信我，试过这种手感之后，你会喜欢上它的。\n- 指针移动时会自动黏附各种按钮、超链接。滚轮的指数级增长的加速度滚动机制使你再也不惧怕超级长的文章和网页。\n- 效果如图：\n  ![CLX-Mouse.gif](./docs/media/CLX-Mouse.gif)\n\n## 使用方法如下\n\n| 作用于 | 按键                                  | 说明                                     |\n| ------ | ------------------------------------- | ---------------------------------------- |\n| 全局   | `CapsLockX + w a s d`                 | 鼠标移动（上下左右）                     |\n| 全局   | `CapsLockX + ad`                      | 将 HJKL 键切换到滚轮模式（上下左右滚动） |\n| 全局   | `CapsLockX + r f`                     | 垂直滚轮（上下）                         |\n| 全局   | `CapsLockX + Shift + r f`             | 水平滚轮（左右）                         |\n| 全局   | `CapsLockX + Ctrl + Alt + r f`        | 垂直滚轮自动滚动（上 下）                |\n| 全局   | `CapsLockX + Ctrl + Alt + Shift+ r f` | 水平滚轮自动滚动（左 右）                |\n| 全局   | `CapsLockX + rf`                      | rf 同时按相当于鼠标中键                  |\n| 全局   | `CapsLockX + e`                       | 鼠标左键                                 |\n| 全局   | `CapsLockX + q`                       | 鼠标右键                                 |\n\n## 操作细节\n\n快速连按 AD 步进=# Simulated Mouse Plugin (WASD QERF)\n\n> I have always considered myself a keyboard enthusiast, probably since I injured my finger joints while making models in the past, becoming a heavy keyboard user. I've used various keyboard acceleration tools, actively memorized various shortcuts, striving to minimize mouse usage, and even learned vim and emacs. However, many times, the mouse is irreplaceable, especially when graphical user interfaces prevail.\n\n—— The above is a quote from the author of [SimClick Simulated Click](https://github.com/rywiki/simclick), a work that simulates the mouse using a grid subdivision method, complementing this project.\n\n—— Recommended by [Qin Jinwei](http://rsytes.coding-pages.com/)\n\n## Features\n\n- This module uses the key area: CapsLockX + QWER ASDF\n- Very comfortably simulate [full] mouse functionality using WASD QE RF. Trust me, once you've tried this feel, you'll like it.\n- The pointer automatically sticks to various buttons and hyperlinks when moving. The exponential growth acceleration scrolling mechanism of the wheel makes you no longer fear super long articles and web pages.\n- Effects as shown:\n  ![CLX-Mouse.gif](./docs/media/CLX-Mouse.gif)\n\n## Usage\n\n| Applied to | Key                                 | Description                              |\n| ---------- | ----------------------------------- | ---------------------------------------- |\n| Global     | `CapsLockX + w a s d`               | Mouse movement (up, down, left, right)   |\n| Global     | `CapsLockX + ad`                    | Switch HJKL keys to scroll mode (up, down, left, right) |\n| Global     | `CapsLockX + r f`                   | Vertical scroll wheel (up, down)         |\n| Global     | `CapsLockX + Shift + r f`           | Horizontal scroll wheel (left, right)    |\n| Global     | `CapsLockX + Ctrl + Alt + r f`      | Automatic vertical scroll wheel (up, down) |\n| Global     | `CapsLockX + Ctrl + Alt + Shift+ r f` | Automatic horizontal scroll wheel (left, right) |\n| Global     | `CapsLockX + rf`                    | Pressing rf simultaneously is equivalent to the mouse middle button |\n| Global     | `CapsLockX + e`                     | Mouse left button                        |\n| Global     | `CapsLockX + q`                     | Mouse right button                       |\n\n## Operation Details\n\nQuickly press AD to step.
# 快捷输入\n\n| 模式 | 快捷输入 | 说明                                            |\n| ---- | -------- | ----------------------------------------------- |\n| 全局 | `#D#`    | 日期输入：`(20220217)`                          |\n| 全局 | `#T#`    | 时间输入：`(20220217.220717)`                   |\n| 全局 | `#DT#`   | 日期时间输入：`2022-02-17 22:07:33`             |\n| 全局 | `#NPW#`  | 随机输入数字密码如： `7500331260229289`         |\n| 全局 | `#PW#`   | 随机输入数字字母密码如： `yyCTCNYodECTLr2h`     |\n| 全局 | `#WPW#`  | 随机输入数字字母密码如： `FtD5BB1m5H98eY7Y`     |\n| 全局 | `#SPW#`  | 随机输入数字字母符号密码如： `/})y+xK]z~>XKQ+p` |=# Quick Input\n\n| Mode | Quick Input | Description                                      |\n| ---- | ----------- | ------------------------------------------------ |\n| Global | `#D#`     | Date Input: `(20220217)`                         |\n| Global | `#T#`     | Time Input: `(20220217.220717)`                  |\n| Global | `#DT#`    | Date Time Input: `2022-02-17 22:07:33`           |\n| Global | `#NPW#`   | Random input of a numeric password, e.g., `7500331260229289`         |\n| Global | `#PW#`    | Random input of an alphanumeric password, e.g., `yyCTCNYodECTLr2h`   |\n| Global | `#WPW#`   | Random input of an alphanumeric password, e.g., `FtD5BB1m5H98eY7Y`   |\n| Global | `#SPW#`   | Random input of an alphanumeric and symbol password, e.g., `/})y+xK]z~>XKQ+p` |
# 窗口增强插件 (CLX + 1234567890 ZXCV)\n\n## 功能简述\n\n用好 Win 10 自带的 10 个虚拟桌面豪华配置、多显示器自动排列窗口、半透明置顶、（注：任务栏和 AltTab 相关功能暂不兼容 Win11，窗口排列功能正常。）\n\n1. 窗口切换：`CapsLockX + [Shift] + Z`\n2. 窗口关闭：`CapsLockX + [Shift] + X`\n3. 窗口排列：`CapsLockX + [Shift] + C`\n4. 窗口置顶：`CapsLockX + [Shift] + V`\n5. 左手窗口管理：在 `Alt + Tab` 的界面，用 `WASD` 切换窗口，`X` 关掉窗口。\n6. 高效使用虚拟桌面：`CapsLockX + 0123456789` 切换、增减虚拟桌面，加上 `Shift` 键可以转移当前窗口\n7. 虚拟机与远程桌面快速脱离：双击左边 `Shift + Ctrl + Alt`。\n\n## 效果图\n\n- Alt + Tab 管理窗口增强\n  ![02-插件-窗口增强_Alt+Tab+WASD管理窗口.gif](./02-插件-窗口增强_Alt+Tab+WASD管理窗口.gif)\n- CapsLockX + C 一键排列窗口（这 GIF 是旧版本录的看起来比较卡，新版本优化过 API 就不卡了）\n  ![02-插件-窗口增强_一键排列窗口.gif](./docs/media/02-插件-窗口增强_一键排列窗口.gif)\n\n## 使用方法如下 ( Alt+Tab 与 CapsLockX )\n\n| 作用域       | 窗口增强模块                          | 说明                                       |\n| ------------ | ------------------------------------- | ------------------------------------------ |\n| Alt+Tab 界面 | `Q E`                                 | 左右切换多桌面                             |\n| Alt+Tab 界面 | `W A S D`                             | 上下左右切换窗口选择                       |\n| Alt+Tab 界面 | `X C`                                 | 关闭选择的窗口（目前 X 和 C 没有区别）     |\n| Win+Tab 视图 | `Alt + W A S D`                       | 切换窗口选择                               |\n| 全局         | `Win + [Shift] + B`                   | 定位到托盘任务(windows 系統自帯熱鍵)       |\n| 全局         | `Win + [Shift] + T`                   | 定位到任務栏任务(windows 系統自帯熱鍵)     |\n| 全局         | `Win + Shift + hjkl`                  | 在窗口之间按方向切换焦点                   |\n| 任务栏       | `Ctrl + W 或 Delete`                  | 在托盘图标或任务栏任务上，选择退出按钮     |\n| 全局         | `CapsLockX + 1 2 ... 9 0`             | 切换到第 1 .. 12 个桌面                    |\n| 全局         | `CapsLockX + Shift + 1 2 ... 9 0 - \e` | 把当前窗口移到第 n 个桌面(如果有的话)      |\n| 全局         | `CapsLockX + Alt + Backspace`         | 删除当前桌面（会把所有窗口移到上一个桌面） |\n| 全局         | `CapsLockX + C`                       | 快速排列当前桌面的窗口                     |\n| 全局         | `CapsLockX + Ctrl + C`                | 快速排列当前桌面的窗口（包括最小化的窗口） |\n| 全局         | `CapsLockX + Shift + C`               | 快速堆叠当前桌面的窗口                     |\n| 全局         | `CapsLockX + Shift + Ctrl + C`        | 快速堆叠当前桌面的窗口（包括最小化的窗口） |\n| 全局         | `CapsLockX + Z`                       | 循环切到最近使用的窗口                     |\n| 全局         | `CapsLockX + Shift + Z`               | 循环切到最不近使用的窗口                   |\n| 全局         | `CapsLockX + X`                       | 关掉当前标签页 Ctrl+W                      |\n| 全局         | `CapsLockX + Shift + X`               | 关掉当前窗口 Alt+F4                        |\n| 全局         | `CapsLockX + V`                       | 让窗口透明                                 |\n| 全局         | `CapsLockX + Shift + V`               | 让窗口保持透明（并置顶）                   |\n| 任意窗口     | `双击左边 Shift+Ctrl+Alt`             | 后置当前窗口， \\* 见下方注                 |\n\n\\*注： 双击左边 Shift+Ctrl+Alt 设计用于远程桌面与虚拟机，使其可与本机桌面窗口同时显示。\n例如 mstsc.exe、TeamViewer、VirtualBox、HyperV、VMWare 等远程桌面或虚拟机程序，配合 CapsLockX + Shift + V 透明置顶功能，让你在 Windows 的界面上同时使用 Linux 界面或 MacOS 界面再也不是难题。\n\n此处借用 [@yangbin9317 的评论](https://v2ex.com/t/772052#r_10458792)\n\n> 以 CapsLock 为抓手,打通底层逻辑,拉齐 Windows 和 Linux WM,解决了 Windows 难用的痛点\n\n(20220313) 对于两端都是 Windows 的情况，也可以考虑使用 [RemoteApp Tool - Kim Knight](http://www.kimknight.net/remoteapptool) 来代替远程桌面。=# Window Enhancement Plugin (CLX + 1234567890 ZXCV)\n\n## Brief Description\n\nUtilize the deluxe configuration of 10 virtual desktops built into Win 10, automatic arrangement of windows on multiple displays, semi-transparent always-on-top (Note: Taskbar and AltTab related features are temporarily incompatible with Win11, window arrangement features work fine.)\n\n1. Window Switching: `CapsLockX + [Shift] + Z`\n2. Close Window: `CapsLockX + [Shift] + X`\n3. Arrange Window: `CapsLockX + [Shift] + C`\n4. Always on Top: `CapsLockX + [Shift] + V`\n5. Left-hand Window Management: In the `Alt + Tab` interface, use `WASD` to switch windows, `X` to close a window.\n6. Efficient Use of Virtual Desktops: `CapsLockX + 0123456789` to switch, add or remove virtual desktops, and use the `Shift` key to move the current window.\n7. Quickly Disconnect Virtual Machines and Remote Desktops: Double click the left `Shift + Ctrl + Alt`.\n\n## Effect Images\n\n- Alt + Tab Enhanced Window Management\n  ![02-Plugin-Window Enhancement_Alt+Tab+WASD Window Management.gif](./02-Plugin-Window Enhancement_Alt+Tab+WASD Window Management.gif)\n- CapsLockX + C One-key to Arrange Windows (This GIF was recorded in an older version, which seems laggy. The new version optimized the API, so it's no longer laggy.)\n  ![02-Plugin-Window Enhancement_One-Key Arrange Windows.gif](./docs/media/02-Plugin-Window Enhancement_One-Key Arrange Windows.gif)\n\n## Usage Instructions ( Alt+Tab and CapsLockX )\n\n| Scope        | Window Enhancement Module              | Description                                |\n| ------------ | -------------------------------------- | ------------------------------------------ |\n| Alt+Tab View | `Q E`                                  | Switch between multiple desktops           |\n| Alt+Tab View | `W A S D`                              | Switch window selection up, down, left, right |\n| Alt+Tab View | `X C`                                  | Close the selected window (currently, X and C have no difference) |\n| Win+Tab View | `Alt + W A S D`                        | Switch window selection                    |\n| Global       | `Win + [Shift] + B`                    | Navigate to tray task (Windows built-in hotkey) |\n| Global       | `Win + [Shift] + T`                    | Navigate to taskbar task (Windows built-in hotkey) |\n| Global       | `Win + Shift + hjkl`                   | Switch focus between windows in the direction |\n| Taskbar      | `Ctrl + W or Delete`                   | Choose the exit button on tray icon or taskbar task |\n| Global       | `CapsLockX + 1 2 ... 9 0`              | Switch to the 1st ... 12th desktop         |\n| Global       | `CapsLockX + Shift + 1 2 ... 9 0 - \e`  | Move the current window to the nth desktop (if available) |\n| Global       | `CapsLockX + Alt + Backspace`          | Delete the current desktop (all windows will move to the previous desktop) |\n| Global       | `CapsLockX + C`                        | Quickly arrange windows on the current desktop |\n| Global       | `CapsLockX + Ctrl + C`                 | Quickly arrange windows on the current desktop (including minimized windows) |\n| Global       | `CapsLockX + Shift + C`                | Quickly stack windows on the current desktop |\n| Global       | `CapsLockX + Shift + Ctrl + C`         | Quickly stack windows on the current desktop (including minimized windows) |\n| Global       | `CapsLockX + Z`                        | Cycle to the most recently used window     |\n| Global       | `CapsLockX + Shift + Z`                | Cycle to the least recently used window    |\n| Global       | `CapsLockX + X`                        | Close the current tab Ctrl+W               |\n| Global       | `CapsLockX + Shift + X`                | Close the current window Alt+F4            |\n| Global       | `CapsLockX + V`                       
# 番茄时钟\n\n25 分钟固定循环休息提醒。\n\n使用 `CapsLockX + ,` 打开配置，然后修改 EnableScheduleTasks\e1 即可启用本插件。\n\n- 使用番茄报时（00 分和 30 分播放工作铃声，每小时的 25 分和 55 分播放休息铃声）（需要先开启定时任务）\n\n  ```ini\n  UseTomatoLife\e1\n  ```\n\n- 使用番茄报时时，自动切换桌面（使用番茄报时时，自动切换桌面（休息桌面为 1，工作桌面为 2）\n\n  ```ini\n  UseTomatoLifeSwitchVirtualDesktop\e1\n  ```\n\n注：如果只需要声音而不需要自动切换桌面的话，也可试试这款 Chrome 插件 [Tomato Life - Chrome 网上应用店](https://chrome.google.com/webstore/detail/25min-tomato-life/kkacpbmkhbljebmpcopjlgfgbgeokbhn)\n\n注注: 本插件已经分离出一个独立项目，如果你喜欢番茄工作法的话可以参见雪星的 tomato-life 项目： [snomiao/tomato-life](https://github.com/snomiao/tomato-life)=# Pomodoro Timer\n\nA 25-minute fixed cycle rest reminder.\n\nUse `CapsLockX + ,` to open the configuration, then modify EnableScheduleTasks\e1 to enable this plugin.\n\n- Use Pomodoro timing (play work chime at 00 and 30 minutes, play rest chime at 25 and 55 minutes each hour) (requires enabling scheduled tasks first)\n\n  ```ini\n  UseTomatoLife\e1\n  ```\n\n- Automatically switch desktops when using Pomodoro timing (rest desktop is 1, work desktop is 2)\n\n  ```ini\n  UseTomatoLifeSwitchVirtualDesktop\e1\n  ```\n\nNote: If you only need the sound without automatic desktop switching, you can try this Chrome extension [Tomato Life - Chrome Web Store](https://chrome.google.com/webstore/detail/25min-tomato-life/kkacpbmkhbljebmpcopjlgfgbgeokbhn)\n\nNote: This plugin has been separated into an independent project. If you like the Pomodoro Technique, you can refer to Snow Star's tomato-life project: [snomiao/tomato-life](https://github.com/snomiao/tomato-life)
# 锁屏自动息屏\n\n按 Win + L 锁屏时，立即关闭屏幕，适用于准备睡觉的时候自动把电脑屏幕关掉，不让它在睡觉的时候刺眼……\n按 Win + Alt + L 立即关闭屏幕，适用于准备睡觉的时候把电脑屏幕关掉，不让它在睡觉的时候刺眼……=# Auto screen off on lock screen\n\nWhen pressing Win + L to lock the screen, it immediately turns off the screen, suitable for automatically turning off the computer screen when preparing to sleep, preventing it from being glaring during sleep...\nPress Win + Alt + L to immediately turn off the screen, suitable for turning off the computer screen when preparing to sleep, preventing it from being glaring during sleep...
